import classes from './TermOfUseComponent.module.css';

const TermOfUseComponent = () => {
  return (
    <div>
      <div className={classes.PageHeader}>
        <div className={classes.PageTitle}>
          <p>Roblox Market - RM Shop</p>
          <h1>Пользовательское соглашение</h1>
        </div>
      </div>
      <div className={classes.PageContent}>
        <div className={classes.PageContentAbzac}>
          ВНИМАНИЕ! ПОЖАЛУЙСТА, ОЗНАКОМЬТЕСЬ С НАСТОЯЩИМ ПОЛЬЗОВАТЕЛЬСКИМ СОГЛАШЕНИЕМ ДО НАЧАЛА ИСПОЛЬЗОВАНИЯ САЙТА
          roblox-market.ru И ЕГО ПРОГРАММНЫХ СРЕДСТВ. РЕГИСТРАЦИЯ (АВТОРИЗАЦИЯ) НА САЙТЕ БУДЕТ ОЗНАЧАТЬ ВАШЕ СОГЛАСИЕ С
          УСЛОВИЯМИ НАСТОЯЩЕГО ПОЛЬЗОВАТЕЛЬСКОГО СОГЛАШЕНИЯ. ЕСЛИ ВЫ НЕ СОГЛАСНЫ С УСЛОВИЯМИ НАСТОЯЩЕГО
          ПОЛЬЗОВАТЕЛЬСКОГО СОГЛАШЕНИЯ, НЕ ПРИОБРЕТАЙТЕ НА САЙТЕ roblox-market.ru И НЕ ИСПОЛЬЗУЙТЕ ЕГО ПРОГРАММНЫЕ
          СРЕДСТВА.{' '}
        </div>
        <div className={classes.PageContentAbzac}>1. ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ</div>
        <div>
          1.1 В НАСТОЯЩЕМ ПОЛЬЗОВАТЕЛЬСКОМ СОГЛАШЕНИИ, ЕСЛИ ИЗ ТЕКСТА ПРЯМО НЕ ВЫТЕКАЕТ ИНОЕ, СЛЕДУЮЩИЕ ТЕРМИНЫ БУДУТ
          ИМЕТЬ УКАЗАННЫЕ НИЖЕ ЗНАЧЕНИЯ:
        </div>
        <div>
          «ПОЛЬЗОВАТЕЛЬ» - ЛЮБОЕ ФИЗИЧЕСКОЕ ЛИЦО, КОТОРОЕ ОФОРМЛЯЯ ЗАКАЗ НА ПРЕДОСТАВЛЕНИЕ «УСЛУГ», ИНФОРМАЦИЯ О КОТОРЫХ
          РАЗМЕЩЕНА НА «ИНТЕРНЕТ-САЙТЕ», ПРИНИМАЕТ (АКЦЕПТУЕТ) НАСТОЯЩЕЕ ПУБЛИЧНОЕ ПРЕДЛОЖЕНИЕ (ОФЕРТУ) О ЗАКЛЮЧЕНИИ
          ДОГОВОРА ВОЗМЕЗДНОГО ОКАЗАНИЯ УСЛУГ.{' '}
        </div>
        <div>
          «УСЛУГИ» - ДЕЙСТВИЯ ИСПОЛНИТЕЛЯ, ОСУЩЕСТВЛЯЕМЫЕ ИМ ОТ СВОЕГО ИМЕНИ, НО ЗА СЧЕТ ЗАКАЗЧИКА, НАПРАВЛЕННЫЕ НА
          ОРГАНИЗАЦИЮ ВЗАИМОДЕЙСТВИЯ ЗАКАЗЧИКА С ИГРОКАМИ ПО ОСУЩЕСТВЛЕНИЮ ИМИ ТЕХ ИЛИ ИНЫХ ДЕЙСТВИЙ В ОТНОШЕНИИ
          ПРЕДМЕТА УСЛУГИ В РАМКАХ СООТВЕТСТВУЮЩЕЙ ИГРЫ.
        </div>
        <div>
          «ВЛАДЕЛЕЦ» - ИНТЕРНЕТ-МАГАЗИН roblox-market.ru, ОКАЗЫВАЮЩИЙ ЗАКАЗЧИКАМ ПРЕДОСТАВЛЕНИЕ УСЛУГ В СООТВЕТСТВИИ С
          УСЛОВИЯМИ НАСТОЯЩЕЙ ОФЕРТЫ.
        </div>
        <div>
          «ИГРА» — ИНТЕРАКТИВНАЯ КОМПЬЮТЕРНАЯ ОНЛАЙН ИГРА, ЯВЛЯЮЩАЯСЯ ПРОГРАММОЙ ДЛЯ АППАРАТНО-ПРОГРАММНОГО
          ВЫЧИСЛИТЕЛЬНОГО УСТРОЙСТВА, РЕАЛИЗОВАННОГО НА ЭЛЕКТРОННЫХ КОМПОНЕНТАХ И ВЫПОЛНЯЮЩЕЕ ЗАДАННЫЕ ПРОГРАММОЙ
          ДЕЙСТВИЯ.
        </div>
        <div>«ИГРОК» — ЛИЦО, ПРИНИМАЮЩЕЕ УЧАСТИЕ В ИГРЕ.</div>
        <div>
          «АКЦЕПТ ОФЕРТЫ» – ПОЛНОЕ И БЕЗОГОВОРОЧНОЕ ПРИНЯТИЕ ОФЕРТЫ ЗАКАЗЧИКОМ, ПУТЕМ ОФОРМЛЕНИЯ ЗАКАЗА НА
          «ИНТЕРНЕТ-САЙТЕ» И ЕГО ОПЛАТЫ.
        </div>
        <div>
          «ИНТЕРНЕТ-САЙТ» - СОСТАВНЫЕ ПРОИЗВЕДЕНИЯ, ПРЕДСТАВЛЯЮЩИЕ СОБОЙ СОВОКУПНОСТЬ ИНФОРМАЦИИ, ТЕКСТОВ, ГРАФИЧЕСКИХ
          ЭЛЕМЕНТОВ, ДИЗАЙНА, ИЗОБРАЖЕНИЙ, ФОТО И ВИДЕОМАТЕРИАЛОВ, ПРОГРАММ ДЛЯ ЭВМ, ИНЫХ РЕЗУЛЬТАТОВ ИНТЕЛЛЕКТУАЛЬНОЙ
          ДЕЯТЕЛЬНОСТИ, ЗА ИСКЛЮЧЕНИЕМ ИНВЕНТАРЯ, СОДЕРЖАЩИХСЯ В ИНФОРМАЦИОННОЙ СИСТЕМЕ, ОБЕСПЕЧИВАЮЩЕЙ ДОСТУПНОСТЬ
          ТАКОЙ ИНФОРМАЦИИ В СЕТИ ИНТЕРНЕТ В ПРЕДЕЛАХ ДОМЕННОЙ ЗОНЫ roblox-market.ru
        </div>
        <div>«РОБЛОКС» - МНОГОПОЛЬЗОВАТЕЛЬСКАЯ ОНЛАЙН-ПЛАТФОРМА</div>
        <div>
          1.2. ВСЕ ОСТАЛЬНЫЕ ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ, ВСТРЕЧАЮЩИЕСЯ В ТЕКСТЕ СОГЛАШЕНИЯ, ТОЛКУЮТСЯ СТОРОНАМИ В
          СООТВЕТСТВИИ С ЗАКОНОДАТЕЛЬСТВОМ ЭСТОНИИ И СЛОЖИВШИМИСЯ В СЕТИ ИНТЕРНЕТ ОБЫЧНЫМИ ПРАВИЛАМИ ТОЛКОВАНИЯ
          СООТВЕТСТВУЮЩИХ ТЕРМИНОВ.
        </div>
        <div>
          1.3. НАЗВАНИЯ ЗАГОЛОВКОВ (СТАТЕЙ) СОГЛАШЕНИЯ ПРЕДНАЗНАЧЕНЫ ИСКЛЮЧИТЕЛЬНО ДЛЯ УДОБСТВА ПОЛЬЗОВАНИЯ ТЕКСТОМ
          СОГЛАШЕНИЯ И БУКВАЛЬНОГО ЮРИДИЧЕСКОГО ЗНАЧЕНИЯ НЕ ИМЕЮТ.
        </div>
        <div className={classes.PageContentAbzac}>2. ОСНОВЫНЕ ПОЛОЖЕНИЯ</div>
        <div>
          2.1. ДАННОЕ СОГЛАШЕНИЕ ПРЕДУСМАТРИВАЕТ ФОРМАЛИЗАЦИЮ ПРОЦЕССА ИСПОЛЬЗОВАНИЯ ПОСЕТИТЕЛЕМ (ПОТРЕБИТЕЛЕМ) ВСЕХ
          ВОЗМОЖНОСТЕЙ СЕТЕВОГО РЕСУРСА roblox-market.ru.
        </div>
        <div>
          2.2. К ВОЗМОЖНОСТЯМ УКАЗАННОГО СЕТЕВОГО РЕСУРСА ОТНОСЯТСЯ НИЖЕ ПЕРЕЧИСЛЕННЫЕ ПУНКТЫ, НО НЕ ОГРАНИЧИВАЯСЬ: А)
          ПРЕДОСТАВЛЕНИЕ ИНФОРМАЦИИ О ПРОГРАММНЫХ ПРОДУКТАХ, ДОПОЛНИТЕЛЬНО ПРИМЕНЯЕМЫХ ПРИ ИСПОЛЬЗОВАНИИ ПРОГРАММНОГО
          ОБЕСПЕЧЕНИЯ ROBLOX, ЯВЛЯЮЩЕГОСЯ КОМПЬЮТЕРНОЙ МНОГОПОЛЬЗОВАТЕЛЬСКОЙ КОМАНДНОЙ ИГРОЙ ROBLOX, А ТАКЖЕ ОБ ИХ
          СТОИМОСТИ; Б) ФОРМАЛЬНОЕ ПРЕДЛОЖЕНИЕ ПРАВООБЛАДАТЕЛЯ ДАННОГО СЕТЕВОГО РЕСУРСА, АДРЕСОВАННОЕ НЕОГРАНИЧЕННОМУ
          КРУГУ ПОСЕТИТЕЛЕЙ (ПОТРЕБИТЕЛЕЙ) ЗАКЛЮЧИТЬ СДЕЛКУ ПО ОКАЗАНИЮ УСЛУГ ПРИ ПОКУПКЕ ЛЮБЫХ ДОПОЛНИТЕЛЬНЫХ
          ПРОГРАММНЫХ ПРОДУКТОВ, С УКАЗАНИЕМ ВСЕХ НЕОБХОДИМЫХ ДЛЯ ЭТОГО УСЛОВИЙ; В) ПРОГРАММНЫЙ КОД, ИНТЕГРИРОВАННЫЙ В
          СТРУКТУРУ ДАННОГО СЕТЕВОГО РЕСУРСА, РЕЗУЛЬТАТ ДЕЙСТВИЯ КОТОРОГО ПРЕДСТАВЛЯЕТ СОБОЙ АВТОМАТИЧЕСКУЮ
          НЕРЕПРЕЗЕНТАТИВНУЮ ВЫБОРКУ ДОПОЛНИТЕЛЬНОГО ПРОГРАММНОГО ПРОДУКТА В СЛУЧАЕ ЗАКЛЮЧЕНИЯ СДЕЛКИ С ПОСЕТИТЕЛЕМ
          (ПОТРЕБИТЕЛЕМ) РЕСУРСА; Г) ИНТЕГРАЦИЯ С СЕРВИСОМ ПО ОПЛАТЕ СОВЕРШЁННОЙ ПОКУПКИ; Д) ТЕХНИЧЕСКАЯ ПОДДЕРЖКА,
          РЕАЛИЗОВАННАЯ В ВИДЕ ОБРАТНОЙ СВЯЗИ И ПОСРЕДСТВОМ ПЕРЕЧНЯ НАИБОЛЕЕ ЧАСТО ЗАДАВАЕМЫХ ВОПРОСОВ (FAQ).
        </div>
        <div>
          2.3. ПРИ ИСПОЛЬЗОВАНИИ ПРИОБРЕТЁННОГО ДОПОЛНИТЕЛЬНОГО ПРОГРАММНОГО ПРОДУКТА В РОБЛОКС ГАРАНТИРУЕТСЯ ЕГО
          РАБОТОСПОСОБНОСТЬ И СООТВЕТСТВИЕ КОЛИЧЕСТВУ, УКАЗАННОМУ ПРИ ОПЛАТЕ
        </div>
        <div>
          2.4. РИСК ДАЛЬНЕЙШЕГО ИСПОЛЬЗОВАНИЯ ПРИОБРЕТЕННОГО ПРОГРАММНОГО ПРОДУКТА С МОМЕНТА ЕГО ЗАЧИСЛЕНИЯ В ROBLOX
          ПЕРЕХОДИТ ПОЛНОСТЬЮ НА ПОСЕТИТЕЛЯ. ПРАВООБЛАДАТЕЛЬ СЕТЕВОГО РЕСУРСА roblox-market.ru НЕ НЕСЁТ ОТВЕТСТВЕННОСТИ
          ЗА ВОЗМОЖНЫЕ ПОСЛЕДСТВИЯ ИСПОЛЬЗОВАНИЯ, ПРИОБРЕТЁННОГО ПОСЕТИТЕЛЕМ (ПОТРЕБИТЕЛЕМ) ПРОГРАММНОГО ПРОДУКТА В
          РОБЛОКС.
        </div>
        <div>
          2.5. ОПЛАТА ЗАКАЗА ВОЗМОЖНА ЧЕРЕЗ ПЛАТЕЖНУЮ СИСТЕМУ ТИНЬКОФФ. ЧТОБЫ ОПЛАТИТЬ ПОКУПКУ, ВЫ БУДЕТЕ ПЕРЕНАПРАВЛЕНЫ
          НА СЕРВЕР ПЛАТЕЖНОЙ СИСТЕМЫ ТИНЬКОФФ, НА КОТОРОМ НУЖНО ВВЕСТИ НЕОБХОДИМЫЕ ДАННЫЕ. ВАШИ КОНФИДЕНЦИАЛЬНЫЕ
          ДАННЫЕ, НЕОБХОДИМЫЕ ДЛЯ ОПЛАТЫ (РЕКВИЗИТЫ КАРТЫ, РЕГИСТРАЦИОННЫЕ ДАННЫЕ И ДР.), НЕ ПОСТУПАЮТ В
          ИНТЕРНЕТ-МАГАЗИН — ИХ ОБРАБОТКА ПРОИЗВОДИТСЯ НА СТОРОНЕ ПРОЦЕССИНГОВОГО ЦЕНТРА ТИНЬКОФФ И ПОЛНОСТЬЮ ЗАЩИЩЕНА
        </div>
        <div className={classes.PageContentAbzac}>3. ПРЕДМЕТ СОГЛАШЕНИЯ</div>
        <div>3.1. ВЛАДЕЛЕЦ ПРЕДОСТАВЛЯЕТ ПОЛЬЗОВАТЕЛЮ:</div>
        <div>
          3.1.1. БЕЗВОЗМЕЗДНУЮ ПРОСТУЮ (НЕИСКЛЮЧИТЕЛЬНУЮ) ЛИЦЕНЗИЮ НА ИСПОЛЬЗОВАНИЕ САЙТА И ЕГО ПРОГРАММНЫХ СРЕДСТВ ПО
          ИХ ПРЯМОМУ НАЗНАЧЕНИЮ, КАК ТО ПРЕДУСМОТРЕНО ЯВНЫМИ ПОЛЬЗОВАТЕЛЬСКИМИ ФУНКЦИЯМИ САЙТА И ЛИЧНОГО КАБИНЕТА
        </div>
        <div>3.2. УКАЗАННАЯ В ПУНКТЕ:</div>
        <div>
          3.2.1 СОГЛАШЕНИЯ ЛИЦЕНЗИЯ ПРЕДОСТАВЛЯЕТСЯ ПОЛЬЗОВАТЕЛЮ НА СРОК, В ТЕЧЕНИЕ КОТОРОГО, И В ПРЕДЕЛАХ ТЕРРИТОРИИ,
          НА КОТОРОЙ САЙТ И ЛИЧНЫЙ КАБИНЕТ ОСТАЮТСЯ ДОСТУПНЫМИ ДЛЯ ПОЛЬЗОВАТЕЛЯ.
        </div>
        <div>3.3. ПОЛЬЗОВАТЕЛЮ ЗАПРЕЩАЕТСЯ:</div>
        <div>3.3.1. ОБХОДИТЬ ТЕХНИЧЕСКИЕ ОГРАНИЧЕНИЯ, УСТАНОВЛЕННЫЕ НА САЙТЕ</div>
        <div>
          3.3.2. ИЗУЧАТЬ ТЕХНОЛОГИЮ, ДЕКОМПИЛИРОВАТЬ ИЛИ ДИЗАССЕМБЛИРОВАТЬ САЙТ, ЛИЧНЫЙ КАБИНЕТ, ЗА ИСКЛЮЧЕНИЕМ СЛУЧАЕВ,
          ПРЯМО ПРЕДУСМОТРЕННЫХ ЗАКОНОДАТЕЛЬСТВОМ;
        </div>
        <div>
          <div>
            3.3.3. СОЗДАВАТЬ КОПИИ ЭКЗЕМПЛЯРОВ САЙТА, СОЦИАЛЬНЫХ СЕТЕЙ И ЛИЧНОГО КАБИНЕТА, А ТАКЖЕ ИХ ВНЕШНЕГО
            ОФОРМЛЕНИЯ (ДИЗАЙНА);{' '}
          </div>
        </div>
        <div>3.3.4. ИЗМЕНЯТЬ САЙТ, УСЛУГИ И ЛИЧНЫЙ КАБИНЕТ КАКИМ БЫ ТО НИ БЫЛО СПОСОБОМ;</div>
        <div>
          3.3.5. СОВЕРШАТЬ ДЕЙСТВИЯ, НАПРАВЛЕННЫЕ НА ИЗМЕНЕНИЕ ФУНКЦИОНИРОВАНИЯ И РАБОТОСПОСОБНОСТИ САЙТА И ЛИЧНОГО
          КАБИНЕТА;
        </div>
        <div>3.3.6. ПРЕДОСТАВЛЯТЬ ДОСТУП К ЛИЧНОМУ КАБИНЕТУ ТРЕТЬЕМУ ЛИЦУ;</div>
        <div>
          3.4. ПРЕДМЕТОМ СОГЛАШЕНИЯ, ПРИ ЕГО АКЦЕПТЕ ПОСЕТИТЕЛЕМ (ПОТРЕБИТЕЛЕМ), ЯВЛЯЕТСЯ КУПЛЯ-ПРОДАЖА УСЛУГ ПО
          ПОЛУЧЕНИЮ ДОПОЛНИТЕЛЬНЫХ ПРОГРАММНЫХ ПРОДУКТОВ ДЛЯ ИСПОЛЬЗОВАНИЯ В ROBLOX, СОГЛАСНО КАТАЛОГУ КАТЕГОРИЙ
          ПРОДУКТОВ, РАЗМЕЩЕННОМУ НА ГЛАВНОЙ СТРАНИЦЕ СЕТЕВОГО РЕСУРСА roblox-market.ru
        </div>
        <div className={classes.PageContentAbzac}>4. ПЕРСОНАЛЬНЫЕ ДАННЫЕ</div>
        <div>
          4.1. ПОЛЬЗОВАТЕЛЬ ДАЕТ СВОЕ СОГЛАСИЕ roblox-market.ru НА ОБРАБОТКУ ИНФОРМАЦИИ, В ТОМ ЧИСЛЕ, ПЕРСОНАЛЬНЫХ
          ДАННЫХ ПОЛЬЗОВАТЕЛЯ, ПРЕДОСТАВЛЕННЫХ ПРИ ИСПОЛЬЗОВАНИИ САЙТА;
        </div>
        <div>
          4.2. ОБРАБОТКА ПЕРСОНАЛЬНЫХ ДАННЫХ ОЗНАЧАЕТ ЗАПИСЬ, СИСТЕМАТИЗАЦИЮ, НАКОПЛЕНИЕ, ХРАНЕНИЕ, УТОЧНЕНИЕ
          (ОБНОВЛЕНИЕ, ИЗМЕНЕНИЕ), ИЗВЛЕЧЕНИЕ, ИСПОЛЬЗОВАНИЕ, ПЕРЕДАЧУ (РАСПРОСТРАНЕНИЕ, ПРЕДОСТАВЛЕНИЕ, ДОСТУП), В ТОМ
          ЧИСЛЕ ТРАНСГРАНИЧНУЮ, ОБЕЗЛИЧИВАНИЕ, БЛОКИРОВАНИЕ, УДАЛЕНИЕ, УНИЧТОЖЕНИЕ ПЕРСОНАЛЬНЫХ ДАННЫХ, НЕ ПОДПАДАЮЩИХ
          ПОД СПЕЦИАЛЬНЫЕ КАТЕГОРИИ, НА ОБРАБОТКУ КОТОРЫХ ТРЕБУЕТСЯ ПИСЬМЕННОЕ СОГЛАСИЕ ПОЛЬЗОВАТЕЛЯ;
        </div>
        <div className={classes.PageContentAbzac}>5. ПОРЯДОК РАЗРЕШЕНИЯ СПОРОВ И УРЕГУЛИРОВАНИЯ ПРЕТЕНЗИЙ</div>
        <div>
          5.1. В СЛУЧАЕ ВОЗНИКНОВЕНИЯ СПОРОВ МЕЖДУ ПОЛЬЗОВАТЕЛЕМ И СЕРВИСОМ ПО ПОВОДУ ИСПОЛНЕНИЯ НАСТОЯЩЕГО СОГЛАШЕНИЮ,
          СТОРОНЫ ПРИМУТ ВСЕ МЕРЫ К РАЗРЕШЕНИЮ ИХ ПУТЕМ ПЕРЕГОВОРОВ МЕЖДУ СОБОЙ. ПРЕТЕНЗИОННЫЙ ПОРЯДОК РАЗРЕШЕНИЯ СПОРОВ
          ОБЯЗАТЕЛЕН.
        </div>
        <div>
          5.2. ПРЕТЕНЗИИ ПРИНИМАЮТСЯ И РАССМАТРИВАЮТСЯ ВЛАДЕЛЬЦЕМ ТОЛЬКО В ПИСЬМЕННОМ ВИДЕ ЧЕРЕЗ СЛУЖБУ ПОДДЕРЖКИ В
          СОЦИАЛЬНЫХ СЕТЯХ, УКАЗАННЫХ НА САЙТЕ.
        </div>
        <div>
          5.3. СРОК РАССМОТРЕНИЯ СПОРОВ ЧЕРЕЗ СЛУЖБУ ПОДДЕРЖКИ 14 СУТОК С МОМЕНТА ОБРАЩЕНИЯ ПОЛЬЗОВАТЕЛЯ К ВЛАДЕЛЬЦУ.
        </div>
        <div>
          5.4 СРОКИ ПРЕДОСТАВЛЕНИЯ УСЛУГ ОПРЕДЕЛЯЮТСЯ МИНИМАЛЬНЫМИ СРОКАМИ, УКАЗАННЫМИ НА ГЛАВНОЙ СТРАНИЦЕ. ПОСЛЕ
          ИСТЕЧЕНИЯ СРОКА ПОЛЬЗОВАТЕЛЬ В ПРАВЕ ОБРАТИТЬСЯ В ТЕХНИЧЕСКУЮ ПОДДЕРЖКУ ДЛЯ РЕШЕНИЯ СПОРОВ.
        </div>
        <div>
          5.5. ДЛЯ РЕШЕНИЯ ПРОБЛЕМ С ПОКУПКОЙ ВЛАДЕЛЕЦ ВПРАВЕ ПОТРЕБОВАТЬ У ПОЛЬЗОВАТЕЛЯ ДОКАЗАТЕЛЬСТВА В ВИДЕ КВИТАНЦИИ
          ОПЛАТЫ, ДАННЫХ, УКАЗАННЫХ ПРИ ОПЛАТЕ
        </div>
        <div className={classes.PageContentAbzac}>6. ОГРАНИЧЕНИЕ ОТВЕТСТВЕННОСТИ</div>
        <div>
          6.1. ВЛАДЕЛЕЦ НЕ ОТВЕЧАЕТ ЗА УБЫТКИ ПОЛЬЗОВАТЕЛЯ, ВОЗНИКШИЕ В РЕЗУЛЬТАТЕ НЕПРАВОМЕРНЫХ ДЕЙСТВИЙ ТРЕТЬИХ ЛИЦ, В
          ТОМ ЧИСЛЕ СВЯЗАННЫХ С НЕПРАВОМЕРНЫМ ДОСТУПОМ К ЛИЧНОМУ КАБИНЕТУ.
        </div>
        <div>
          6.2. ПРОГРАММНО-АППАРАТНЫЕ ОШИБКИ, КАК НА СТОРОНЕ ВЛАДЕЛЬЦА, ТАК И НА СТОРОНЕ ПОЛЬЗОВАТЕЛЯ, ПРИВЕДШИЕ К
          НЕВОЗМОЖНОСТИ ПОЛУЧЕНИЯ ПОЛЬЗОВАТЕЛЕМ ДОСТУПА К САЙТУ, ЯВЛЯЮТСЯ ОБСТОЯТЕЛЬСТВАМИ НЕПРЕОДОЛИМОЙ СИЛЫ, И
          ОСНОВАНИЕМ ОСВОБОЖДЕНИЯ ОТ ОТВЕТСТВЕННОСТИ ЗА НЕИСПОЛНЕНИЕ ОБЯЗАТЕЛЬСТВ roblox-market.ru ПО СОГЛАШЕНИЮ.
        </div>
        <div>
          6.3. ВЛАДЕЛЕЦ НЕ ГАРАНТИРУЕТ, ЧТО САЙТ И ЛИЧНЫЙ КАБИНЕТ СООТВЕТСТВУЮТ ТРЕБОВАНИЯМ ПОЛЬЗОВАТЕЛЯ, ЧТО ДОСТУП К
          САЙТУ И ЛИЧНОМУ КАБИНЕТУ БУДЕТ ПРЕДОСТАВЛЯТЬСЯ НЕПРЕРЫВНО, БЫСТРО, НАДЕЖНО И БЕЗ ОШИБОК.
        </div>
        <div>
          6.4. ОПЛАЧИВАЯ ТОВАР ЛЮБЫМИ ПЛАТЕЖНЫМИ СИСТЕМАМИ, ВЫ БЕРЕТЕ НА СЕБЯ ПОЛНУЮ ОТВЕТСТВЕННОСТЬ ЗА ВАШИ ДЕЙСТВИЯ.
          ПЛОЩАДКА НИКАК НЕ ПРИНУЖДАЕТ И НЕ НАСТАИВАЕТ ДЕЛАТЬ КАКИЕ-ЛИБО ДЕЙСТВИЯ.
        </div>
        <div className={classes.PageContentAbzac}>7. ВОЗВРАТ СРЕДСТВ</div>
        <div>7.1. ПОЛЬЗОВАТЕЛЬ НЕ ИМЕЕТ ПРАВО ЗАПРОСИТЬ ВОЗВРАТ ДЕНЕЖНЫХ СРЕДСТВ</div>
        <div>
          7.2. ВСЕ ПОКУПКИ И АКТИВНОСТИ, ПРОИЗВЕДЕННЫЕ ПОСРЕДСТВОМ СЕРВИСА НА САЙТЕ, ЯВЛЯЮТСЯ ОКОНЧАТЕЛЬНЫМИ И НЕ
          ВОЗМЕЩАЕМЫМИ, ПОТРАЧЕННЫЕ ДЕНЕЖНЫЕ СРЕДСТВА НЕ ПОДЛЕЖАТ ВОЗВРАТУ.
        </div>
        <div className={classes.PageContentAbzac}>8. ИЗМЕНЕНИЕ УСЛОВИЙ СОГЛАШЕНИЯ</div>
        <div>
          8.1. ВЛАДЕЛЕЦ ВПРАВЕ В ОДНОСТОРОННЕМ ПОРЯДКЕ ИЗМЕНЯТЬ УСЛОВИЯ СОГЛАШЕНИЯ, ПРИ ЭТОМ ТАКИЕ ИЗМЕНЕНИЯ ВСТУПАЮТ В
          СИЛУ В МОМЕНТ ОПУБЛИКОВАНИЯ НОВОЙ ВЕРСИИ СОГЛАШЕНИЯ В СЕТИ ИНТЕРНЕТ ПО АДРЕСУ
        </div>
        <div>
          8.2. ПРОДОЛЖЕНИЕ ИСПОЛЬЗОВАНИЯ ФУНКЦИЙ САЙТА БУДЕТ ОЗНАЧАТЬ СОГЛАСИЕ ПОЛЬЗОВАТЕЛЯ С УСЛОВИЯМИ НОВОЙ ВЕРСИИ
          СОГЛАШЕНИЯ. ЕСЛИ ПОЛЬЗОВАТЕЛЬ НЕ СОГЛАСЕН С УСЛОВИЯМИ НОВОЙ ВЕРСИИ СОГЛАШЕНИЯ, ОН ПРЕКРАЩАЕТ ПОЛЬЗОВАТЬСЯ
          САЙТОМ.
        </div>
      </div>
    </div>
  );
};

export default TermOfUseComponent;
