import classes from './PrivacyComponent.module.css';

const PrivacyComponent = () => {
  return (
    <div>
      <div className={classes.PageHeader}>
        <div className={classes.PageTitle}>
          <p>Roblox Market - RM Shop</p>
          <h1>Политика конфиденциальности</h1>
        </div>
      </div>
      <div className={classes.PageContent}>
        <div className={classes.PageContentAbzac}>
          НАСТОЯЩАЯ ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ ПЕРСОНАЛЬНЫХ ДАННЫХ (ДАЛЕЕ – ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ) ДЕЙСТВУЕТ В
          ОТНОШЕНИИ ВСЕЙ ИНФОРМАЦИИ, КОТОРУЮ ТОРГОВАЯ ПЛОЩАДКА «roblox-market.ru», РАСПОЛОЖЕННЫЙ НА ДОМЕННОМ ИМЕНИ
          roblox-market.ru, МОЖЕТ ПОЛУЧИТЬ О ПОЛЬЗОВАТЕЛЕ ВО ВРЕМЯ ИСПОЛЬЗОВАНИЯ САЙТА ИНТЕРНЕТ-МАГАЗИНА, ПРОГРАММ И
          ПРОДУКТОВ ИНТЕРНЕТ-МАГАЗИНА.
        </div>
        <div className={classes.PageContentAbzac}>1. ОПРЕДЕЛЕНИЕ ТЕРМИНОВ</div>
        <div>1.1. В НАСТОЯЩЕЙ ПОЛИТИКЕ КОНФИДЕНЦИАЛЬНОСТИ ИСПОЛЬЗУЮТСЯ СЛЕДУЮЩИЕ ТЕРМИНЫ:</div>
        <div>
          1.1.1. «АДМИНИСТРАЦИЯ САЙТА ТОРГОВОЙ ПЛОЩАДКИ (ДАЛЕЕ – АДМИНИСТРАЦИЯ САЙТА) » – УПОЛНОМОЧЕННЫЕ СОТРУДНИКИ НА
          УПРАВЛЕНИЕ САЙТОМ, ДЕЙСТВУЮЩИЕ ОТ ИМЕНИ roblox-market.ru, КОТОРЫЕ ОРГАНИЗУЮТ И (ИЛИ) ОСУЩЕСТВЛЯЕТ ОБРАБОТКУ
          ПЕРСОНАЛЬНЫХ ДАННЫХ, А ТАКЖЕ ОПРЕДЕЛЯЕТ ЦЕЛИ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ, СОСТАВ ПЕРСОНАЛЬНЫХ ДАННЫХ,
          ПОДЛЕЖАЩИХ ОБРАБОТКЕ, ДЕЙСТВИЯ (ОПЕРАЦИИ), СОВЕРШАЕМЫЕ С ПЕРСОНАЛЬНЫМИ ДАННЫМИ.
        </div>
        <div>
          1.1.2. «ПЕРСОНАЛЬНЫЕ ДАННЫЕ» - ЛЮБАЯ ИНФОРМАЦИЯ, ОТНОСЯЩАЯСЯ К ПРЯМО ИЛИ КОСВЕННО ОПРЕДЕЛЕННОМУ ИЛИ
          ОПРЕДЕЛЯЕМОМУ ФИЗИЧЕСКОМУ ЛИЦУ (СУБЪЕКТУ ПЕРСОНАЛЬНЫХ ДАННЫХ).
        </div>
        <div>
          1.1.3. «ОБРАБОТКА ПЕРСОНАЛЬНЫХ ДАННЫХ» - ЛЮБОЕ ДЕЙСТВИЕ (ОПЕРАЦИЯ) ИЛИ СОВОКУПНОСТЬ ДЕЙСТВИЙ (ОПЕРАЦИЙ),
          СОВЕРШАЕМЫХ С ИСПОЛЬЗОВАНИЕМ СРЕДСТВ АВТОМАТИЗАЦИИ ИЛИ БЕЗ ИСПОЛЬЗОВАНИЯ ТАКИХ СРЕДСТВ С ПЕРСОНАЛЬНЫМИ
          ДАННЫМИ, ВКЛЮЧАЯ СБОР, ЗАПИСЬ, СИСТЕМАТИЗАЦИЮ, НАКОПЛЕНИЕ, ХРАНЕНИЕ, УТОЧНЕНИЕ (ОБНОВЛЕНИЕ, ИЗМЕНЕНИЕ),
          ИЗВЛЕЧЕНИЕ, ИСПОЛЬЗОВАНИЕ, ПЕРЕДАЧУ (РАСПРОСТРАНЕНИЕ, ПРЕДОСТАВЛЕНИЕ, ДОСТУП), ОБЕЗЛИЧИВАНИЕ, БЛОКИРОВАНИЕ,
          УДАЛЕНИЕ, УНИЧТОЖЕНИЕ ПЕРСОНАЛЬНЫХ ДАННЫХ.
        </div>
        <div>
          1.1.4. «КОНФИДЕНЦИАЛЬНОСТЬ ПЕРСОНАЛЬНЫХ ДАННЫХ» - ОБЯЗАТЕЛЬНОЕ ДЛЯ СОБЛЮДЕНИЯ ОПЕРАТОРОМ ИЛИ ИНЫМ ПОЛУЧИВШИМ
          ДОСТУП К ПЕРСОНАЛЬНЫМ ДАННЫМ ЛИЦОМ ТРЕБОВАНИЕ НЕ ДОПУСКАТЬ ИХ РАСПРОСТРАНЕНИЯ БЕЗ СОГЛАСИЯ СУБЪЕКТА
          ПЕРСОНАЛЬНЫХ ДАННЫХ ИЛИ НАЛИЧИЯ ИНОГО ЗАКОННОГО ОСНОВАНИЯ.
        </div>
        <div>
          1.1.5. «ПОЛЬЗОВАТЕЛЬ САЙТА (ДАЛЕЕ ‑ ПОЛЬЗОВАТЕЛЬ)» – ЛИЦО, ИМЕЮЩЕЕ ДОСТУП К САЙТУ, ПОСРЕДСТВОМ СЕТИ ИНТЕРНЕТ И
          ИСПОЛЬЗУЮЩЕЕ САЙТ.
        </div>
        <div>
          1.1.6. «COOKIES» — НЕБОЛЬШОЙ ФРАГМЕНТ ДАННЫХ, ОТПРАВЛЕННЫЙ ВЕБ-СЕРВЕРОМ И ХРАНИМЫЙ НА КОМПЬЮТЕРЕ ПОЛЬЗОВАТЕЛЯ,
          КОТОРЫЙ ВЕБ-КЛИЕНТ ИЛИ ВЕБ-БРАУЗЕР КАЖДЫЙ РАЗ ПЕРЕСЫЛАЕТ ВЕБ-СЕРВЕРУ В HTTP-ЗАПРОСЕ ПРИ ПОПЫТКЕ ОТКРЫТЬ
          СТРАНИЦУ СООТВЕТСТВУЮЩЕГО САЙТА.
        </div>
        <div>
          1.1.7. «IP-АДРЕС» — УНИКАЛЬНЫЙ СЕТЕВОЙ АДРЕС УЗЛА В КОМПЬЮТЕРНОЙ СЕТИ, ПОСТРОЕННОЙ ПО ПРОТОКОЛУ IP. «РОБЛОКС»
          - МНОГОПОЛЬЗОВАТЕЛЬСКАЯ ОНЛАЙН-ПЛАТФОРМА
        </div>
        <div className={classes.PageContentAbzac}>2. ОБЩИЕ ПОЛОЖЕНИЯ</div>
        <div>
          2.1. ИСПОЛЬЗОВАНИЕ ПОЛЬЗОВАТЕЛЕМ САЙТА ИНТЕРНЕТ-МАГАЗИНА ОЗНАЧАЕТ СОГЛАСИЕ С НАСТОЯЩЕЙ ПОЛИТИКОЙ
          КОНФИДЕНЦИАЛЬНОСТИ И УСЛОВИЯМИ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ ПОЛЬЗОВАТЕЛЯ.
        </div>
        <div>
          2.2. В СЛУЧАЕ НЕСОГЛАСИЯ С УСЛОВИЯМИ ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ ПОЛЬЗОВАТЕЛЬ ДОЛЖЕН ПРЕКРАТИТЬ ИСПОЛЬЗОВАНИЕ
          САЙТА.
        </div>
        <div>
          2.3. НАСТОЯЩАЯ ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ ПРИМЕНЯЕТСЯ ТОЛЬКО К САЙТУ roblox-market.ru. САЙТ НЕ КОНТРОЛИРУЕТ И
          НЕ НЕСЕТ ОТВЕТСТВЕННОСТЬ ЗА САЙТЫ ТРЕТЬИХ ЛИЦ, НА КОТОРЫЕ ПОЛЬЗОВАТЕЛЬ МОЖЕТ ПЕРЕЙТИ ПО ССЫЛКАМ, ДОСТУПНЫМ НА
          САЙТЕ.
        </div>
        <div>
          2.4. АДМИНИСТРАЦИЯ САЙТА НЕ ПРОВЕРЯЕТ ДОСТОВЕРНОСТЬ ПЕРСОНАЛЬНЫХ ДАННЫХ, ПРЕДОСТАВЛЯЕМЫХ ПОЛЬЗОВАТЕЛЕМ САЙТА.
        </div>
        <div>
          2.5. ОПЛАТА ЗАКАЗА ВОЗМОЖНА ЧЕРЕЗ ПЛАТЕЖНУЮ СИСТЕМУ ТИНЬКОФФ. ЧТОБЫ ОПЛАТИТЬ ПОКУПКУ, ВЫ БУДЕТЕ ПЕРЕНАПРАВЛЕНЫ
          НА СЕРВЕР ПЛАТЕЖНОЙ СИСТЕМЫ ТИНЬКОФФ, НА КОТОРОМ НУЖНО ВВЕСТИ НЕОБХОДИМЫЕ ДАННЫЕ. ВАШИ КОНФИДЕНЦИАЛЬНЫЕ
          ДАННЫЕ, НЕОБХОДИМЫЕ ДЛЯ ОПЛАТЫ (РЕКВИЗИТЫ КАРТЫ, РЕГИСТРАЦИОННЫЕ ДАННЫЕ И ДР.), НЕ ПОСТУПАЮТ В
          ИНТЕРНЕТ-МАГАЗИН — ИХ ОБРАБОТКА ПРОИЗВОДИТСЯ НА СТОРОНЕ ПРОЦЕССИНГОВОГО ЦЕНТРА ТИНЬКОФФ И ПОЛНОСТЬЮ ЗАЩИЩЕНА
        </div>
        <div className={classes.PageContentAbzac}>3. ПРЕДМЕТ ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ</div>
        <div>
          3.1. НАСТОЯЩАЯ ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ УСТАНАВЛИВАЕТ ОБЯЗАТЕЛЬСТВА АДМИНИСТРАЦИИ САЙТА ТОРГОВОЙ-ПЛОЩАДКИ
          ПО НЕРАЗГЛАШЕНИЮ И ОБЕСПЕЧЕНИЮ РЕЖИМА ЗАЩИТЫ КОНФИДЕНЦИАЛЬНОСТИ ПЕРСОНАЛЬНЫХ ДАННЫХ, КОТОРЫЕ ПОЛЬЗОВАТЕЛЬ
          ПРЕДОСТАВЛЯЕТ ПО ЗАПРОСУ АДМИНИСТРАЦИИ САЙТА ПРИ РЕГИСТРАЦИИ ИЛИ ПРИ ОФОРМЛЕНИИ ЗАКАЗА ДЛЯ ПРИОБРЕТЕНИЯ
          ТОВАРА.
        </div>
        <div>
          3.2. ПЕРСОНАЛЬНЫЕ ДАННЫЕ, РАЗРЕШЁННЫЕ К ОБРАБОТКЕ В РАМКАХ НАСТОЯЩЕЙ ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ,
          ПРЕДОСТАВЛЯЮТСЯ ПОЛЬЗОВАТЕЛЕМ ПУТЁМ ЗАПОЛНЕНИЯ РЕГИСТРАЦИОННОЙ ФОРМЫ НА САЙТЕ roblox-market.ru В РАЗДЕЛЕ
          НАЗВАНИЕ РАЗДЕЛА И ВКЛЮЧАЮТ В СЕБЯ СЛЕДУЮЩУЮ ИНФОРМАЦИЮ:
        </div>
        <div>3.2.1. ФАМИЛИЮ, ИМЯ ПОЛЬЗОВАТЕЛЯ</div>
        <div>3.2.2. АДРЕС ЭЛЕКТРОННОЙ ПОЧТЫ (E-MAIL)</div>
        <div>
          3.3. ТОРГОВАЯ ПЛОЩАДКА ЗАЩИЩАЕТ ДАННЫЕ, КОТОРЫЕ АВТОМАТИЧЕСКИ ПЕРЕДАЮТСЯ В ПРОЦЕССЕ ПРОСМОТРА РЕКЛАМНЫХ БЛОКОВ
          И ПРИ ПОСЕЩЕНИИ СТРАНИЦ: · IP АДРЕС; · ИНФОРМАЦИЯ ИЗ COOKIES; · ИНФОРМАЦИЯ О БРАУЗЕРЕ (ИЛИ ИНОЙ ПРОГРАММЕ,
          КОТОРАЯ ОСУЩЕСТВЛЯЕТ ДОСТУП К ПОКАЗУ РЕКЛАМЫ); · ВРЕМЯ ДОСТУПА; · АДРЕС СТРАНИЦЫ, НА КОТОРОЙ РАСПОЛОЖЕН
          РЕКЛАМНЫЙ БЛОК; · РЕФЕРЕР (АДРЕС ПРЕДЫДУЩЕЙ СТРАНИЦЫ).
        </div>
        <div>3.3.1. ОТКЛЮЧЕНИЕ COOKIES МОЖЕТ ПОВЛЕЧЬ НЕВОЗМОЖНОСТЬ ДОСТУПА К ЧАСТЯМ САЙТА, ТРЕБУЮЩИМ АВТОРИЗАЦИИ.</div>
        <div>
          3.3.2. ТОРГОВАЯ ПЛОЩАДКА ОСУЩЕСТВЛЯЕТ СБОР СТАТИСТИКИ ОБ IP-АДРЕСАХ СВОИХ ПОСЕТИТЕЛЕЙ. ДАННАЯ ИНФОРМАЦИЯ
          ИСПОЛЬЗУЕТСЯ С ЦЕЛЬЮ ВЫЯВЛЕНИЯ И РЕШЕНИЯ ТЕХНИЧЕСКИХ ПРОБЛЕМ, ДЛЯ КОНТРОЛЯ ЗАКОННОСТИ ПРОВОДИМЫХ ФИНАНСОВЫХ
          ПЛАТЕЖЕЙ.
        </div>
        <div>
          3.4. ЛЮБАЯ ИНАЯ ПЕРСОНАЛЬНАЯ ИНФОРМАЦИЯ НЕОГОВОРЕННАЯ ВЫШЕ (ИСТОРИЯ ПОКУПОК, ИСПОЛЬЗУЕМЫЕ БРАУЗЕРЫ И
          ОПЕРАЦИОННЫЕ СИСТЕМЫ И Т.Д.) ПОДЛЕЖИТ НАДЕЖНОМУ ХРАНЕНИЮ И НЕРАСПРОСТРАНЕНИЮ, ЗА ИСКЛЮЧЕНИЕМ СЛУЧАЕВ,
          ПРЕДУСМОТРЕННЫХ В П.П. 5.2. И 5.3. НАСТОЯЩЕЙ ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ.
        </div>
        <div className={classes.PageContentAbzac}>4. ЦЕЛИ СБОРА ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЯ</div>
        <div>4.1. ПЕРСОНАЛЬНЫЕ ДАННЫЕ ПОЛЬЗОВАТЕЛЯ АДМИНИСТРАЦИЯ САЙТА МОЖЕТ ИСПОЛЬЗОВАТЬ В ЦЕЛЯХ:</div>
        <div>
          4.1.1. ИДЕНТИФИКАЦИИ ПОЛЬЗОВАТЕЛЯ, ЗАРЕГИСТРИРОВАННОГО НА САЙТЕ, ДЛЯ ОФОРМЛЕНИЯ ЗАКАЗА ДИСТАНЦИОННЫМ СПОСОБОМ
          С roblox-market.ru.
        </div>
        <div>4.1.2. ПРЕДОСТАВЛЕНИЯ ПОЛЬЗОВАТЕЛЮ ДОСТУПА К ПЕРСОНАЛИЗИРОВАННЫМ РЕСУРСАМ САЙТА.</div>
        <div>
          4.1.3. УСТАНОВЛЕНИЯ С ПОЛЬЗОВАТЕЛЕМ ОБРАТНОЙ СВЯЗИ, ВКЛЮЧАЯ НАПРАВЛЕНИЕ УВЕДОМЛЕНИЙ, ЗАПРОСОВ, КАСАЮЩИХСЯ
          ИСПОЛЬЗОВАНИЯ САЙТА, ОКАЗАНИЯ УСЛУГ, ОБРАБОТКА ЗАПРОСОВ И ЗАЯВОК ОТ ПОЛЬЗОВАТЕЛЯ.
        </div>
        <div>4.1.4. ПОДТВЕРЖДЕНИЯ ДОСТОВЕРНОСТИ И ПОЛНОТЫ ПЕРСОНАЛЬНЫХ ДАННЫХ, ПРЕДОСТАВЛЕННЫХ ПОЛЬЗОВАТЕЛЕМ.</div>
        <div>
          4.1.5. СОЗДАНИЯ УЧЕТНОЙ ЗАПИСИ ДЛЯ СОВЕРШЕНИЯ ПОКУПОК, ЕСЛИ ПОЛЬЗОВАТЕЛЬ ДАЛ СОГЛАСИЕ НА СОЗДАНИЕ УЧЕТНОЙ
          ЗАПИСИ.
        </div>
        <div>4.1.6. УВЕДОМЛЕНИЯ ПОЛЬЗОВАТЕЛЯ САЙТА О СОСТОЯНИИ ПЛАТЕЖА.</div>
        <div>4.1.7. ОБРАБОТКИ И ПОЛУЧЕНИЯ ПЛАТЕЖЕЙ, ОСПАРИВАНИЯ ПЛАТЕЖА.</div>
        <div>
          4.1.8. ПРЕДОСТАВЛЕНИЯ ПОЛЬЗОВАТЕЛЮ ЭФФЕКТИВНОЙ КЛИЕНТСКОЙ И ТЕХНИЧЕСКОЙ ПОДДЕРЖКИ ПРИ ВОЗНИКНОВЕНИИ ПРОБЛЕМ
          СВЯЗАННЫХ С ИСПОЛЬЗОВАНИЕМ САЙТА
        </div>
        <div>
          4.1.9. ПРЕДОСТАВЛЕНИЯ ДОСТУПА ПОЛЬЗОВАТЕЛЮ НА САЙТЫ ИЛИ СЕРВИСЫ ПАРТНЕРОВ С ЦЕЛЬЮ ПОЛУЧЕНИЯ ПРОДУКТОВ,
          ОБНОВЛЕНИЙ И УСЛУГ.
        </div>
        <div className={classes.PageContentAbzac}>5. СПОСОБЫ И СРОКИ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ</div>
        <div>
          5.1. ОБРАБОТКА ПЕРСОНАЛЬНЫХ ДАННЫХ ПОЛЬЗОВАТЕЛЯ ОСУЩЕСТВЛЯЕТСЯ БЕЗ ОГРАНИЧЕНИЯ СРОКА, ЛЮБЫМ ЗАКОННЫМ СПОСОБОМ,
          В ТОМ ЧИСЛЕ В ИНФОРМАЦИОННЫХ СИСТЕМАХ ПЕРСОНАЛЬНЫХ ДАННЫХ С ИСПОЛЬЗОВАНИЕМ СРЕДСТВ АВТОМАТИЗАЦИИ ИЛИ БЕЗ
          ИСПОЛЬЗОВАНИЯ ТАКИХ СРЕДСТВ.
        </div>
        <div>
          5.2. ПОЛЬЗОВАТЕЛЬ СОГЛАШАЕТСЯ С ТЕМ, ЧТО АДМИНИСТРАЦИЯ САЙТА ВПРАВЕ ПЕРЕДАВАТЬ ПЕРСОНАЛЬНЫЕ ДАННЫЕ ТРЕТЬИМ
          ЛИЦАМ, В ЧАСТНОСТИ ПЛАТЁЖНЫМ СИСТЕМАМ, ЧЕРЕЗ КОТОРЫЕ ПОЛЬЗОВАТЕЛЬ СОВЕРШАЛ ОПЛАТУ ЗАКАЗА.
        </div>
        <div>
          5.3. ПЕРСОНАЛЬНЫЕ ДАННЫЕ ПОЛЬЗОВАТЕЛЯ МОГУТ БЫТЬ ПЕРЕДАНЫ УПОЛНОМОЧЕННЫМ ОРГАНАМ ГОСУДАРСТВЕННОЙ ВЛАСТИ В
          ПОРЯДКЕ, УСТАНОВЛЕННЫМ ЗАКОНОДАТЕЛЬСТВОМ ЭСТОНСКОЙ РЕСПУБЛИКИ.
        </div>
        <div>
          5.4. ПРИ УТРАТЕ ИЛИ РАЗГЛАШЕНИИ ПЕРСОНАЛЬНЫХ ДАННЫХ АДМИНИСТРАЦИЯ САЙТА ИНФОРМИРУЕТ ПОЛЬЗОВАТЕЛЯ ОБ УТРАТЕ ИЛИ
          РАЗГЛАШЕНИИ ПЕРСОНАЛЬНЫХ ДАННЫХ.
        </div>
        <div>
          5.5. АДМИНИСТРАЦИЯ САЙТА ПРИНИМАЕТ НЕОБХОДИМЫЕ ОРГАНИЗАЦИОННЫЕ И ТЕХНИЧЕСКИЕ МЕРЫ ДЛЯ ЗАЩИТЫ ПЕРСОНАЛЬНОЙ
          ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЯ ОТ НЕПРАВОМЕРНОГО ИЛИ СЛУЧАЙНОГО ДОСТУПА, УНИЧТОЖЕНИЯ, ИЗМЕНЕНИЯ, БЛОКИРОВАНИЯ,
          КОПИРОВАНИЯ, РАСПРОСТРАНЕНИЯ, А ТАКЖЕ ОТ ИНЫХ НЕПРАВОМЕРНЫХ ДЕЙСТВИЙ ТРЕТЬИХ ЛИЦ.
        </div>
        <div>
          5.6. АДМИНИСТРАЦИЯ САЙТА СОВМЕСТНО С ПОЛЬЗОВАТЕЛЕМ ПРИНИМАЕТ ВСЕ НЕОБХОДИМЫЕ МЕРЫ ПО ПРЕДОТВРАЩЕНИЮ УБЫТКОВ
          ИЛИ ИНЫХ ОТРИЦАТЕЛЬНЫХ ПОСЛЕДСТВИЙ, ВЫЗВАННЫХ УТРАТОЙ ИЛИ РАЗГЛАШЕНИЕМ ПЕРСОНАЛЬНЫХ ДАННЫХ ПОЛЬЗОВАТЕЛЯ.
        </div>
        <div className={classes.PageContentAbzac}>6. ОБЯЗАТЕЛЬСТВА СТОРОН</div>
        <div>6.1. ПОЛЬЗОВАТЕЛЬ ОБЯЗАН:</div>
        <div>6.1.1. ПРЕДОСТАВИТЬ ИНФОРМАЦИЮ О ПЕРСОНАЛЬНЫХ ДАННЫХ, НЕОБХОДИМУЮ ДЛЯ ПОЛЬЗОВАНИЯ САЙТОМ.</div>
        <div>
          6.1.2. ОБНОВИТЬ, ДОПОЛНИТЬ ПРЕДОСТАВЛЕННУЮ ИНФОРМАЦИЮ О ПЕРСОНАЛЬНЫХ ДАННЫХ В СЛУЧАЕ ИЗМЕНЕНИЯ ДАННОЙ
          ИНФОРМАЦИИ.
        </div>
        <div>6.2. АДМИНИСТРАЦИЯ САЙТА ОБЯЗАНА:</div>
        <div>
          6.2.1. ИСПОЛЬЗОВАТЬ ПОЛУЧЕННУЮ ИНФОРМАЦИЮ ИСКЛЮЧИТЕЛЬНО ДЛЯ ЦЕЛЕЙ, УКАЗАННЫХ В П. 4 НАСТОЯЩЕЙ ПОЛИТИКИ
          КОНФИДЕНЦИАЛЬНОСТИ.
        </div>
        <div>
          6.2.2. ОБЕСПЕЧИТЬ ХРАНЕНИЕ КОНФИДЕНЦИАЛЬНОЙ ИНФОРМАЦИИ В ТАЙНЕ, НЕ РАЗГЛАШАТЬ БЕЗ ПРЕДВАРИТЕЛЬНОГО ПИСЬМЕННОГО
          РАЗРЕШЕНИЯ ПОЛЬЗОВАТЕЛЯ, А ТАКЖЕ НЕ ОСУЩЕСТВЛЯТЬ ПРОДАЖУ, ОБМЕН, ОПУБЛИКОВАНИЕ, ЛИБО РАЗГЛАШЕНИЕ ИНЫМИ
          ВОЗМОЖНЫМИ СПОСОБАМИ ПЕРЕДАННЫХ ПЕРСОНАЛЬНЫХ ДАННЫХ ПОЛЬЗОВАТЕЛЯ, ЗА ИСКЛЮЧЕНИЕМ П.П. 5.2. И 5.3. НАСТОЯЩЕЙ
          ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ.
        </div>
        <div>
          6.2.3. ПРИНИМАТЬ МЕРЫ ПРЕДОСТОРОЖНОСТИ ДЛЯ ЗАЩИТЫ КОНФИДЕНЦИАЛЬНОСТИ ПЕРСОНАЛЬНЫХ ДАННЫХ ПОЛЬЗОВАТЕЛЯ СОГЛАСНО
          ПОРЯДКУ, ОБЫЧНО ИСПОЛЬЗУЕМОГО ДЛЯ ЗАЩИТЫ ТАКОГО РОДА ИНФОРМАЦИИ В СУЩЕСТВУЮЩЕМ ДЕЛОВОМ ОБОРОТЕ.
        </div>
        <div>
          6.2.4. ОСУЩЕСТВИТЬ БЛОКИРОВАНИЕ ПЕРСОНАЛЬНЫХ ДАННЫХ, ОТНОСЯЩИХСЯ К СООТВЕТСТВУЮЩЕМУ ПОЛЬЗОВАТЕЛЮ, С МОМЕНТА
          ОБРАЩЕНИЯ ИЛИ ЗАПРОСА ПОЛЬЗОВАТЕЛЯ ИЛИ ЕГО ЗАКОННОГО ПРЕДСТАВИТЕЛЯ ЛИБО УПОЛНОМОЧЕННОГО ОРГАНА ПО ЗАЩИТЕ ПРАВ
          СУБЪЕКТОВ ПЕРСОНАЛЬНЫХ ДАННЫХ НА ПЕРИОД ПРОВЕРКИ, В СЛУЧАЕ ВЫЯВЛЕНИЯ НЕДОСТОВЕРНЫХ ПЕРСОНАЛЬНЫХ ДАННЫХ ИЛИ
          НЕПРАВОМЕРНЫХ ДЕЙСТВИЙ.
        </div>
        <div className={classes.PageContentAbzac}>7. ОТВЕТСТВЕННОСТЬ СТОРОН</div>
        <div>
          7.1. АДМИНИСТРАЦИЯ САЙТА, НЕ ИСПОЛНИВШАЯ СВОИ ОБЯЗАТЕЛЬСТВА, НЕСЁТ ОТВЕТСТВЕННОСТЬ ЗА УБЫТКИ, ПОНЕСЁННЫЕ
          ПОЛЬЗОВАТЕЛЕМ В СВЯЗИ С НЕПРАВОМЕРНЫМ ИСПОЛЬЗОВАНИЕМ ПЕРСОНАЛЬНЫХ ДАННЫХ, В СООТВЕТСТВИИ С ЗАКОНОДАТЕЛЬСТВОМ
          ЭСТОНСКОЙ РЕСПУБЛИКИ.
        </div>
        <div>
          7.2. В СЛУЧАЕ УТРАТЫ ИЛИ РАЗГЛАШЕНИЯ КОНФИДЕНЦИАЛЬНОЙ ИНФОРМАЦИИ АДМИНИСТРАЦИЯ САЙТА НЕ НЕСЁТ ОТВЕТСТВЕННОСТЬ,
          ЕСЛИ ДАННАЯ КОНФИДЕНЦИАЛЬНАЯ ИНФОРМАЦИЯ:
        </div>
        <div>7.2.1. СТАЛА ПУБЛИЧНЫМ ДОСТОЯНИЕМ ДО ЕЁ УТРАТЫ ИЛИ РАЗГЛАШЕНИЯ.</div>
        <div>7.2.2. БЫЛА ПОЛУЧЕНА ОТ ТРЕТЬЕЙ СТОРОНЫ ДО МОМЕНТА ЕЁ ПОЛУЧЕНИЯ АДМИНИСТРАЦИЕЙ САЙТА.</div>
        <div>7.2.3. БЫЛА РАЗГЛАШЕНА С СОГЛАСИЯ ПОЛЬЗОВАТЕЛЯ.</div>
        <div className={classes.PageContentAbzac}>8. РАЗРЕШЕНИЕ СПОРОВ</div>
        <div>
          8.1. ДО ОБРАЩЕНИЯ В СУД С ИСКОМ ПО СПОРАМ, ВОЗНИКАЮЩИМ ИЗ ОТНОШЕНИЙ МЕЖДУ ПОЛЬЗОВАТЕЛЕМ САЙТА И АДМИНИСТРАЦИЕЙ
          САЙТА, ОБЯЗАТЕЛЬНЫМ ЯВЛЯЕТСЯ ПРЕДЪЯВЛЕНИЕ ПРЕТЕНЗИИ (ПИСЬМЕННОГО ПРЕДЛОЖЕНИЯ О ДОБРОВОЛЬНОМ УРЕГУЛИРОВАНИИ
          СПОРА).
        </div>
        <div>
          8.2 .ПОЛУЧАТЕЛЬ ПРЕТЕНЗИИ В ТЕЧЕНИЕ 30 КАЛЕНДАРНЫХ ДНЕЙ СО ДНЯ ПОЛУЧЕНИЯ ПРЕТЕНЗИИ, ПИСЬМЕННО УВЕДОМЛЯЕТ
          ЗАЯВИТЕЛЯ ПРЕТЕНЗИИ О РЕЗУЛЬТАТАХ РАССМОТРЕНИЯ ПРЕТЕНЗИИ.
        </div>
        <div>
          8.3. ПРИ НЕ ДОСТИЖЕНИИ СОГЛАШЕНИЯ СПОР МОЖЕТ БЫТЬ ПЕРЕДАН НА РАССМОТРЕНИЕ В СУДЕБНЫЙ ОРГАН В СООТВЕТСТВИИ С
          ДЕЙСТВУЮЩИМ ЗАКОНОДАТЕЛЬСТВОМ ЭСТОНСКОЙ РЕСПУБЛИКИ
        </div>
        <div className={classes.PageContentAbzac}>9. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ</div>
        <div>
          9.1. АДМИНИСТРАЦИЯ САЙТА ВПРАВЕ ВНОСИТЬ ИЗМЕНЕНИЯ В НАСТОЯЩУЮ ПОЛИТИКУ КОНФИДЕНЦИАЛЬНОСТИ БЕЗ СОГЛАСИЯ
          ПОЛЬЗОВАТЕЛЯ.
        </div>
        <div>
          9.2. НОВАЯ ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ ВСТУПАЕТ В СИЛУ С МОМЕНТА ЕЕ РАЗМЕЩЕНИЯ НА САЙТЕ, ЕСЛИ ИНОЕ НЕ
          ПРЕДУСМОТРЕНО НОВОЙ РЕДАКЦИЕЙ ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ.
        </div>
        <div>
          9.3. ДЕЙСТВУЮЩАЯ ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ РАЗМЕЩЕНА НА СТРАНИЦЕ ПО АДРЕСУ
          https://roblox-market.ru/privacypolicy
        </div>
      </div>
    </div>
  );
};

export default PrivacyComponent;
